---
title: DuplicateTypeNamesHandlerArgs
classe: Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DuplicateTypeNamesHandlerArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Document Document { get; }` | `duplicateTypeNamesHandlerArgs.Document` | Document |
| `Boolean IsValidObject { get; }` | `duplicateTypeNamesHandlerArgs.IsValidObject` | Boolean |
| `Void Dispose()` | `duplicateTypeNamesHandlerArgs.Dispose()` | Void |
| `ICollection<ElementId> GetTypeIds()` | `duplicateTypeNamesHandlerArgs.GetTypeIds()` | ICollection<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```